SecurityEvent
| where EventID == 4720 or EventID == 4732 or EventID == 4740
| where TargetUserName has "OAuth"
| summarize count() by TargetUserName, EventID, EventTime
| project TargetUserName, EventID, EventTime
