// Author: Microsoft Azure
// Display name: Change or Reset Passwords Attempts
// Description: Counts change/reset paswords attempts per target account.
// Categories: security
// Solutions: SecurityInsights
// Topic: Security

SecurityEvent
| where EventID in (4723, 4724)
| summarize count() by TargetAccount