// Author: Microsoft Azure
// Display name: Computers With Guest Account Logons
// Description: Computers with logons from guest accounts.
// Categories: security
// Solutions: SecurityInsights
// Topic: Security logon

SecurityEvent
| where EventID == 4624 and TargetUserName == 'Guest' and LogonType in (10, 3)
| summarize count() by Computer