// Author: Microsoft Azure
// Display name: Logons With Clear Text Password
// Description: Logons with clear text password by target account.
// Categories: security
// Solutions: SecurityInsights
// Topic: Security logon

SecurityEvent
| where EventID == 4624 and LogonType == 8
| summarize count() by TargetAccount