{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "** Author **\r\n[Bruno Gabrielli](mailto:bruno.gabrielli@microsoft.com)\r\n\r\n** Version 1.4 **\r\n2020-09-24\r\n- Added default selected value to Subscription, Workspace and Server parameters.\r\n\r\n** Version 1.3 **\r\n2020-05-21\r\n- Revisited parameter section to avoid null selection and error messages.\r\n- Added guidance to configure storage of Azure Activity log into a workspace if necessary.\r\n\r\n** Version 1.2 **\r\n2020-03-09\r\n- Changed the server parameter query to filter out non Virtual Machine items such as extension, Disks and so on\r\n- Refined queries to use _ResourceId which is using a consistent case\r\n\r\n** Version 1.1**\r\n2020-03-05\r\n - Fixed time range issue in the {Servers} parameter.\r\n - Changed notes text for running virtual machine.\r\n\r\n** Version 1.0 **\r\n2020-02-21\r\n - Initial version."
      },
      "conditionalVisibility": {
        "parameterName": "_",
        "comparison": "isEqualTo",
        "value": "_"
      },
      "name": "GeneralInfo"
    },
    {
      "type": 1,
      "content": {
        "json": "# Virtual Machine uptime #"
      },
      "name": "WorkbookName"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "crossComponentResources": [
          "{Subscriptions}"
        ],
        "parameters": [
          {
            "id": "1e2b3246-fe4e-4d39-b265-7a42a4ae46c1",
            "version": "KqlParameterItem/1.0",
            "name": "DefaultSubscription_Internal",
            "type": 1,
            "isRequired": true,
            "query": "where type =~ 'microsoft.operationalinsights/workspaces'\r\n| take 1\r\n| project subscriptionId",
            "crossComponentResources": [
              "value::selected"
            ],
            "isHiddenWhenLocked": true,
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "99cc0623-1cf2-42ee-ae97-0e1321843c9d",
            "version": "KqlParameterItem/1.0",
            "name": "Subscriptions",
            "type": 6,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "summarize by subscriptionId\r\n| project value = strcat(\"/subscriptions/\", subscriptionId), label = subscriptionId, selected = iff(subscriptionId =~ '{DefaultSubscription_Internal}', true, false)",
            "crossComponentResources": [
              "value::selected"
            ],
            "value": [
              "/subscriptions/05a1b94d-16d2-461a-8e0d-af047c697628"
            ],
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "showDefault": false
            },
            "defaultValue": "value::all",
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "e249244e-b556-4ecb-aae0-36843bc5a5a7",
            "version": "KqlParameterItem/1.0",
            "name": "Workspaces",
            "type": 5,
            "isRequired": true,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "where type =~ 'microsoft.operationalinsights/workspaces'\r\n| project id, selected = iff(id =~ todynamic('{DefaultSubscription_Internal}').ws, true, false), custId= properties.customerId",
            "crossComponentResources": [
              "{Subscriptions}"
            ],
            "value": [
              "/subscriptions/05a1b94d-16d2-461a-8e0d-af047c697628/resourceGroups/mms-weu/providers/Microsoft.OperationalInsights/workspaces/OMS-BR1"
            ],
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "showDefault": false
            },
            "defaultValue": "value::all",
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "b672f960-bf26-4368-b002-e1e6e9a8990d",
            "version": "KqlParameterItem/1.0",
            "name": "IsAzureActivityEnabled",
            "type": 2,
            "isRequired": true,
            "query": "AzureActivity\r\n| take 1\r\n| summarize count() ",
            "crossComponentResources": [
              "{Workspaces}"
            ],
            "value": "value::1",
            "isHiddenWhenLocked": true,
            "typeSettings": {
              "additionalResourceOptions": [
                "value::1"
              ]
            },
            "timeContext": {
              "durationMs": 0
            },
            "timeContextFromParameter": "TimeRange",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          }
        ],
        "style": "pills",
        "queryType": 1,
        "resourceType": "microsoft.resourcegraph/resources"
      },
      "name": "ParameterSection-1"
    },
    {
      "type": 1,
      "content": {
        "json": "<br>\r\n### ⚠️  Data from Azure Activity, which is necessary for this workbook to work properly, was not found in the selected workspace.\r\n---\r\n\r\nPlease select another workspace or check out the detailed documentation on how to collect Azure Activity logs in Azure Monitor at [this](https://docs.microsoft.com/en-us/azure/azure-monitor/platform/activity-log-collect#collecting-activity-log) link."
      },
      "conditionalVisibility": {
        "parameterName": "IsAzureActivityEnabled",
        "comparison": "isEqualTo",
        "value": "0"
      },
      "name": "AzureActivityNotEnabled"
    },
    {
      "type": 12,
      "content": {
        "version": "NotebookGroup/1.0",
        "groupType": "editable",
        "items": [
          {
            "type": 9,
            "content": {
              "version": "KqlParameterItem/1.0",
              "crossComponentResources": [
                "{Workspaces}"
              ],
              "parameters": [
                {
                  "id": "5e8549d6-22aa-47e0-a84b-bf1848cd44cc",
                  "version": "KqlParameterItem/1.0",
                  "name": "TimeRange",
                  "type": 4,
                  "isRequired": true,
                  "value": {
                    "durationMs": 2592000000
                  },
                  "typeSettings": {
                    "selectableValues": [
                      {
                        "durationMs": 300000
                      },
                      {
                        "durationMs": 900000
                      },
                      {
                        "durationMs": 1800000
                      },
                      {
                        "durationMs": 3600000
                      },
                      {
                        "durationMs": 14400000
                      },
                      {
                        "durationMs": 43200000
                      },
                      {
                        "durationMs": 86400000
                      },
                      {
                        "durationMs": 172800000
                      },
                      {
                        "durationMs": 259200000
                      },
                      {
                        "durationMs": 604800000
                      },
                      {
                        "durationMs": 1209600000
                      },
                      {
                        "durationMs": 2419200000
                      },
                      {
                        "durationMs": 2592000000
                      },
                      {
                        "durationMs": 5184000000
                      },
                      {
                        "durationMs": 7776000000
                      }
                    ],
                    "allowCustom": true
                  }
                },
                {
                  "id": "3f3a75cc-17b1-49b7-a3ec-264301546011",
                  "version": "KqlParameterItem/1.0",
                  "name": "Servers",
                  "type": 2,
                  "isRequired": true,
                  "multiSelect": true,
                  "quote": "'",
                  "delimiter": ",",
                  "query": "AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\"\r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| distinct Resource\r\n| order by Resource asc",
                  "crossComponentResources": [
                    "{Workspaces}"
                  ],
                  "value": [
                    "value::all"
                  ],
                  "typeSettings": {
                    "additionalResourceOptions": [
                      "value::all"
                    ]
                  },
                  "timeContext": {
                    "durationMs": 0
                  },
                  "timeContextFromParameter": "TimeRange",
                  "queryType": 0,
                  "resourceType": "microsoft.operationalinsights/workspaces"
                },
                {
                  "id": "cf942ef9-4cb0-4b23-8fdf-e3cd3536a5b1",
                  "version": "KqlParameterItem/1.0",
                  "name": "TimeZone",
                  "type": 2,
                  "isRequired": true,
                  "typeSettings": {
                    "additionalResourceOptions": []
                  },
                  "jsonData": "[\r\n    { \"value\":\"-3\", \"label\":\"UTC-3\", \"selected\":false },\r\n    { \"value\":\"-2\", \"label\":\"UTC-2\", \"selected\":false },\r\n    { \"value\":\"-1\", \"label\":\"UTC-1\", \"selected\":false },\r\n    { \"value\":\"0\", \"label\":\"UTC+0\", \"selected\":true },\r\n    { \"value\":\"1\", \"label\":\"UTC+1\", \"selected\":false },\r\n    { \"value\":\"2\", \"label\":\"UTC+2\", \"selected\":false },\r\n    { \"value\":\"3\", \"label\":\"UTC+3\", \"selected\":false }\r\n]"
                }
              ],
              "style": "pills",
              "queryType": 0,
              "resourceType": "microsoft.insights/components"
            },
            "name": "ParameterSection-2"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "let _now = toscalar(now());\r\nlet defaultStopVM = AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\"\r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers})\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| distinct _ResourceId\r\n| extend stopTime=_now;\r\nlet startVM=AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\"\r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers}) \r\n| where OperationName startswith \"start virtual\" \r\n| where ActivityStatusValue == \"Succeeded\"\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| project startTime=TimeGenerated, Resource, _ResourceId;\r\nlet stopVM=AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\" \r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers})\r\n| where OperationName startswith \"deallocate virtual\" \r\n| where ActivityStatusValue == \"Succeeded\"\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| project stopTime=TimeGenerated, Resource, _ResourceId\r\n| union defaultStopVM;\r\nstartVM\r\n| join kind=leftouter (stopVM) on $left._ResourceId == $right._ResourceId\r\n| extend isAfterStart = iff(startTime > stopTime, 0, 1)\r\n| where isAfterStart == 1\r\n| summarize arg_min(stopTime, *) by startTime, Resource\r\n| summarize arg_min(startTime, *) by stopTime, Resource\r\n| order by Resource desc, startTime desc\r\n| project Resource, uptimeMins = datetime_diff('minute',stopTime,startTime)//, uptimeHours = datetime_diff('hour',stopTime,startTime)\r\n//| summarize totUptimeMinByVM = sum(uptimeHours) by Resource\r\n| summarize totUptimeMinByVM = sum(uptimeMins) by Resource",
              "size": 0,
              "showAnalytics": true,
              "title": "Total uptime in minutes by Virtual Machine ",
              "noDataMessage": "No data for the selected time range or resource",
              "timeContext": {
                "durationMs": 2592000000
              },
              "timeContextFromParameter": "TimeRange",
              "showExportToExcel": true,
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspaces}"
              ],
              "visualization": "barchart"
            },
            "showPin": true,
            "name": "query - 5"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "let _now = toscalar(now());\r\nlet defaultStopVM = AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\"\r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers})\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| distinct _ResourceId\r\n| extend stopTime=_now;\r\nlet startVM=AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\"\r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers}) \r\n| where OperationName startswith \"start virtual\" \r\n| where ActivityStatusValue == \"Succeeded\"\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| project startTime=TimeGenerated, Resource, _ResourceId;\r\nlet stopVM=AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\" \r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers})\r\n| where OperationName startswith \"deallocate virtual\" \r\n| where ActivityStatusValue == \"Succeeded\"\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| project stopTime=TimeGenerated, Resource, _ResourceId\r\n| union defaultStopVM;\r\nstartVM\r\n| join kind=leftouter (stopVM) on $left._ResourceId == $right._ResourceId\r\n| extend isAfterStart = iff(startTime > stopTime, 0, 1)\r\n| where isAfterStart == 1\r\n| summarize arg_min(stopTime, *) by startTime, Resource\r\n| summarize arg_min(startTime, *) by stopTime, Resource\r\n| order by Resource desc, startTime desc\r\n| project Resource, startTime, stopTime, uptimeMins = datetime_diff('minute',stopTime,startTime)//, uptimeHours = datetime_diff('hour',stopTime,startTime)\r\n| extend u = range(bin(startTime, 1min), bin(stopTime, 1min), 1min)\r\n| mv-expand u to typeof(datetime)\r\n| summarize count() by Resource, bin(u, 1d)\r\n| render columnchart with (series= Resource)\r\n\r\n//| extend numDays = datetime_diff('Day', stopTime, startTime) \r\n//| extend daysArr = range(startofday(startTime), endofday(stopTime), 1d) \r\n//| extend firstDayMins = pack_array(iff(numDays==0, datetime_diff('Minute', stopTime, startTime), datetime_diff('Minute', endofday(startTime), startTime)))\r\n//| extend middleDaysMins = repeat(1440, max_of(numDays-1,0))\r\n//| extend lastDayMins = pack_array(datetime_diff('Minute', stopTime, startofday(stopTime)))\r\n//| extend minsArr = iff(numDays==0,firstDayMins,array_concat(firstDayMins, middleDaysMins, lastDayMins))\r\n//| mvexpand daysArr to typeof(datetime), minsArr to typeof(int)\r\n//| project Resource, startTime = daysArr, uptimeMins = minsArr",
              "size": 0,
              "showAnalytics": true,
              "title": "Total uptime in minutes by Day",
              "noDataMessage": "No data for the selected time range or resource",
              "timeContext": {
                "durationMs": 2592000000
              },
              "timeContextFromParameter": "TimeRange",
              "showExportToExcel": true,
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspaces}"
              ],
              "visualization": "categoricalbar"
            },
            "showPin": true,
            "name": "query - 6"
          },
          {
            "type": 3,
            "content": {
              "version": "KqlItem/1.0",
              "query": "let _now = toscalar(now());\r\nlet defaultStopVM = AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\"\r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers})\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| distinct _ResourceId\r\n| extend stopTime=_now;\r\nlet startVM=AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\" \r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers})\r\n| where OperationName startswith \"start virtual\" \r\n| where ActivityStatusValue == \"Succeeded\"\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| project startTime=TimeGenerated, Resource, _ResourceId;\r\nlet stopVM=AzureActivity\r\n| where ResourceProvider == \"Microsoft.Compute\"\r\n| where _ResourceId contains \"Microsoft.Compute/virtualMachines\" \r\n| where (indexof(_ResourceId,\"/\",0,-1,9)) == -1\r\n| where Resource in ({Servers})\r\n| where OperationName startswith \"deallocate virtual\" \r\n| where ActivityStatusValue == \"Succeeded\"\r\n| extend TimeGenerated = TimeGenerated + ({TimeZone}*1h)\r\n| project stopTime=TimeGenerated, Resource, _ResourceId\r\n| union defaultStopVM;\r\nstartVM\r\n| join kind=leftouter (stopVM) on $left._ResourceId == $right._ResourceId\r\n| extend isAfterStart = iff(startTime > stopTime, 0, 1)\r\n| where isAfterStart == 1\r\n| summarize arg_min(stopTime, *) by startTime, Resource\r\n| summarize arg_min(startTime, *) by stopTime, Resource\r\n| order by Resource desc, startTime desc\r\n| project Resource, startTime, stopTime, uptimeMins=datetime_diff('minute',stopTime,startTime), uptimeHours=datetime_diff('hour',stopTime,startTime), notes = iif(stopTime ==_now, \"Currently running\", \"\")\r\n| extend stopTime = iif(stopTime ==_now, datetime(null), stopTime)",
              "size": 0,
              "showAnalytics": true,
              "title": "Virtual Machine uptime - Table",
              "noDataMessage": "No data for the selected time range or resource",
              "timeContext": {
                "durationMs": 2592000000
              },
              "timeContextFromParameter": "TimeRange",
              "showExportToExcel": true,
              "queryType": 0,
              "resourceType": "microsoft.operationalinsights/workspaces",
              "crossComponentResources": [
                "{Workspaces}"
              ],
              "gridSettings": {
                "filter": true,
                "sortBy": [
                  {
                    "itemKey": "notes",
                    "sortOrder": 2
                  }
                ],
                "labelSettings": [
                  {
                    "columnId": "Resource",
                    "label": "Virtual Machine Name"
                  },
                  {
                    "columnId": "startTime",
                    "label": "Start Time"
                  },
                  {
                    "columnId": "stopTime",
                    "label": "Stop Time"
                  },
                  {
                    "columnId": "uptimeMins",
                    "label": "Uptime in minutes"
                  },
                  {
                    "columnId": "uptimeHours",
                    "label": "Uptime in hours"
                  },
                  {
                    "columnId": "notes",
                    "label": "Notes"
                  }
                ]
              },
              "sortBy": [
                {
                  "itemKey": "notes",
                  "sortOrder": 2
                }
              ]
            },
            "showPin": true,
            "name": "query - 5"
          }
        ]
      },
      "conditionalVisibility": {
        "parameterName": "IsAzureActivityEnabled",
        "comparison": "isNotEqualTo",
        "value": "0"
      },
      "name": "WorkbookContent"
    }
  ],
  "fallbackResourceIds": [
    "Azure Monitor"
  ],
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}